-----------------------------------------------------------------------------------------------------------
--建立資料庫與了解定序的差異
-----------------------------------------------------------------------------------------------------------
use classNorthwind

insert [dbo].[Table_1] values ('測試')
select * from [dbo].[Table_1]
delete [dbo].[Table_1] where Column_1 = '測試'
-----------------------------------------------------------------------------------------------------------
--查看資料庫相關資訊
-----------------------------------------------------------------------------------------------------------
exec sp_helpdb										--查看伺服器上所有資料庫
exec sp_helpdb classNorthwind		--查看指定資料庫
exec sp_spaceused									--查看資料庫空間使用情況
dbcc sqlperf(logspace)							--查看所有資料庫的log空間使用情況

use Northwind
exec sp_spaceused'[dbo].[Products]'  ----查看指定資料表空間使用情況
-----------------------------------------------------------------------------------------------------------

