----------------------------------------------------------------------------------------------
--建立非欉集索引：以Key去搜尋Key
--若強制搜尋Data會使用RID查詢，導致效能不彰
----------------------------------------------------------------------------------------------
use AdventureWorks
select EmployeeID,ContactID,ManagerID from Employee_Copy --with(index(EmployeeID_N))
where EmployeeID > 10
----------------------------------------------------------------------------------------------
--建立欉集索引：以Key去搜尋Data
----------------------------------------------------------------------------------------------
select * from Employee_Copy --with(index(EmployeeID))
where EmployeeID > 10
----------------------------------------------------------------------------------------------
exec sp_spaceused '[dbo].[Employee_Copy]'